Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4CMS32C_1.xml
      <value-group caption="" name="PIO_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE0">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE1">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE2">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE3">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE4">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE5">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE6">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE7">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE8">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE9">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE10">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE11">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE12">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE13">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE14">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE15">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE16">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE17">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE18">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE19">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE20">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE21">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE22">
        <value caption="High drive" name="HI_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x1"/>
        <value caption="Low drive" name="LO_DRIVE" value="0x2"/>
      </value-group>
